## DataFrame 
rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type(numeric, string, boolean, etc)
- has both a row and column index
- DataFrame is physically two-dimensional, you can use it to represent higher dimensional data in a tabular format using hierarchical indexing

In [2]:
import numpy as np 
import pandas as pd 
from pandas import Series, DataFrame

In [6]:
# most common way : from a dictionary of equal-length lists or NumPy arrays

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
# for large DataFrames, the head method selects only the first five rows
print(frame.head())
# so tail returns the last five rows
print(frame.tail())

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
# can specify a sequence of columns
pd.DataFrame(data, columns=['year', 'state', "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [10]:
# pass a column that isnâ€™t contained in the dictionary
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [11]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [14]:
# column can be retrieved as a Series 
print(frame2['state']) # dictionary like notation
print(frame2.year) # dot attribute notation


# frame2[column] works for any column name, but frame2.column works only when the column name is a valid Python variable name and does not conflict with any of the method names in DataFrame.
# For example, if a columnâ€™s name contains whitespace or symbols other than underscores, it cannot be accessed with the dot attribute method.

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [15]:
# Rows can also be retrieved by position or name with the special iloc and loc attributes 
print(frame2.loc[1])
print(frame2.iloc[2])

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object
year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [16]:
# Columns can be modified by assignment. Ex-
frame2['debt'] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [17]:
frame2.debt = np.arange(6)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

#### Column assignment in DataFrame

- When assigning **lists or arrays**, their length must match the length of the `DataFrame`.
- When assigning a **Series**, Pandas aligns values based on their indices, inserting `NaN` where indices don't match.
- Assigning to a new column name creates that column in the `DataFrame`.

--- 

### Why is This Behavior Useful?

1. **Flexibility**:
   - You can assign lists, arrays, or `Series` to a column dynamically based on your data processing needs.

2. **Index Alignment with Series**:
   - When working with datasets that share indices (e.g., merging data from different sources), automatic index alignment simplifies the process.
   - Mismatched indices are handled gracefully with `NaN` values, indicating missing data.

In [18]:
val = pd.Series([-1.2, -1.5, -1.7, 6.9], index=["two", "four", "five", 3])
frame2['debt'] = val

frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   6.9
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [24]:
# the del keyword will delete columns like with a dictionary
frame2['eastern'] = frame2['state'] == 'Ohio'
print(frame2)

# New columns cannot be created with the frame2.eastern dot attribute notation

del frame2["eastern"]
frame2.columns

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   6.9    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

Index(['year', 'state', 'pop', 'debt'], dtype='object')

- The column returned from indexing a DataFrame is a view on the underlying data, not a copy. 
- Thus, any in-place modifications to the Series will be reflected in the DataFrame. 
- The column can be explicitly copied with the Seriesâ€™s copy method.

In [25]:
# a nested dictionary of dictionaries

populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

# interpreted as outer keys as columns, & the inner keys as the rows indices
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [29]:
# can Transpose the DataFrame (swap rows & cols) with similar syntax
frame3.T

# If you transpose a DataFrame twice (i.e., .T.T), the original shape is restored, but the column data types may not remain the same
# The reason is that during the first transpose, Pandas converts columns into rows with dtype=object. When transposing back, Pandas cannot always infer the original data types correctly.

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [30]:
# explicit index is specified
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [40]:
# Dictionaries of Series are treated in much the same way
pdata = {"Ohio": frame3['Ohio'][:-1], "Nevada": frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [41]:
# dataframe's index and columns have their name attributes set
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [42]:
# to_numpy method converts the data of a DataFrame into a 2-D NumPy array
# resulting array does not retain column or row labels

frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [43]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, 6.9],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

Possible data inputs to the DataFrame constructor: 
| **Data Input Type**          | **Description**                                                                                           |
|-------------------------------|-----------------------------------------------------------------------------------------------------------|
| **Dictionary of arrays, lists, or tuples** | Keys become column names, and values (arrays, lists, tuples) are used as column data.                   | 
| **Dictionary of Series**      | Keys become column names, and `Series` objects are aligned on their index to form the `DataFrame`.         |
| **Dictionary of dictionaries**| Outer dictionary keys become row indices, and inner keys become column names.                             | 
| **List of dictionaries**      | Each dictionary is treated as a row, with keys as column names.                                           | 
| **List of lists, arrays, or tuples** | Each inner list, array, or tuple is treated as a row, and columns are numbered by default or can be labeled. |
| **2D NumPy array**            | Creates a `DataFrame` where the array values populate the table, with optional row/column labels.          | 
| **Series**                    | A single `Series` becomes a `DataFrame` with a single column and its index as the row index.              | 
| **Scalar value**              | A single value is broadcasted to the entire `DataFrame` of the specified shape (using `index` and `columns`). | 
| **Another DataFrame**         | Creates a new `DataFrame` identical to the input `DataFrame`.                                            | 
| **Dictionary of DataFrames**  | Concatenates DataFrames along the outer keys, with keys becoming hierarchical index levels or columns.    |